package chapter7;

public class Edit3 {
/*
 다형성(Polymorphism)
 같은 타입이나 실행 결과가 다양한 객체를 이용할 수 있는 성질.
 => 객체의 부품화 가능.
 
 자동 타입 변환(Promotion)
 프로그램 실행 도중에 자동적으로 타입 변환이 일어나는걸 말함.
 
 부모클래스 변수 = 자식클래스타입;
 자동 변환.
 부모와 특징과 기능을 상속받기 때문에 부모와 동일하게 취급될수 있다.
 Aniaml 클래스(부모)
 Cat 클래스(자식)
 
 Cat cat = new cat();(o)
 Animal animal = new Cat(); 
 타입만 다를 뿐 동일한 Cat 객체를 생성함.
 
 타입 변환 후 오버라이딩 된 메소드를 제외하고 부모 클래스 멤버로만 한정됨.
 객체는 자식 객체 참조.
 
 매개변수의 다형성
 자식 클래시 객체를 부모 클래스 메소드의 매개값으로 넘겨준다면
 매개 변수의타입이 클래스일 경우, 해당 클래스의 객체뿐만 아니라 자식 객체까지도 매개값으로 사용할수 있음.
 
 강제 타입 변환(Casting)
 자식 클래스 변수 = (자식클래스)부모클래스타입;
 자식 타입에 선언된 필드와 메소드를 사용해야한다면 , 강제 타입 변환을 해서 자식타입으로 변환한 다음 자식 타입의 필드와 메소드를 사용하면 됨.
 
 객체 타입 확인 (instanceOf)
 boolean result = 좌항(객체) instanceOf 우항(타입)
 */
}
